demoAPI/src/main/resources/bankrequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ns="http://tpb.vn/gen"
                  >
    <soapenv:Header/>
    <soapenv:Body>
        <ns:GetCustomerInfoReq>
            <ns:Header>
                <ns:Common>
                    <ns:ServiceVersion>1</ns:ServiceVersion>
                    <ns:MessageId>${=java.util.UUID.randomUUID()}</ns:MessageId>
                    <ns:TransactionId>${=java.util.UUID.randomUUID()}</ns:TransactionId>
                    <ns:MessageTimestamp>${=(new Date().format("yyyy-MM-dd'T'HH:mm:ss"))}</ns:MessageTimestamp>
                </ns:Common>
                <ns:Client>
                    <ns:SourceAppID>TEST</ns:SourceAppID>
                    <ns:UserDetail>
                        <ns:UserId>ESB</ns:UserId>
                        <ns:UserPassword>RVNCMQ==</ns:UserPassword>
                    </ns:UserDetail>
                </ns:Client>
            </ns:Header>
            <ns:BodyRequest>
                <ns:AuxInfo>
                    <ns:Xref>ESB123334</ns:Xref>
                    <ns:FunctionCode>CUST-GETCUSINFOBYCIFMST-DB-FCC</ns:FunctionCode>
                </ns:AuxInfo>
                <ns:AccInfo>
                    <ns:CIFNo>29092005</ns:CIFNo>
                    <ns:AdditionInformation>
                        <ns:NameValuePairs>
                            <ns:Name>MST</ns:Name>
                            <ns:Value>0102100740</ns:Value>
                        </ns:NameValuePairs>
                        <ns:NameValuePairs>
                            <ns:Name>DKKD</ns:Name>
                            <ns:Value>040051000013</ns:Value>
                        </ns:NameValuePairs>
                    </ns:AdditionInformation>
                </ns:AccInfo>
            </ns:BodyRequest>
        </ns:GetCustomerInfoReq>
    </soapenv:Body>
</soapenv:Envelope>
